package com.adaptive.ui.type;

/**
 * Created by yeta on 2017/4/6/006.
 * 所有用户类型
 */
public interface UserType {
    public static final String TYPE1 = "活跃型";
    public static final String TYPE2 = "沉思型";
    public static final String TYPE3 = "感悟型";
    public static final String TYPE4 = "自觉型";
    public static final String TYPE5 = "视觉型";
    public static final String TYPE6 = "言语型";
    public static final String TYPE7 = "序列型";
    public static final String TYPE8 = "综合型";

    /**
     * 每种类型的解释
     *
     * 1.活跃型与沉思型
     * 活跃型学习者倾向于通过积极地做一些事—讨论或应用或解释给别人听来掌握信息。而沉思型学习者更喜欢首先安静地思考问题。“来，我们试试看，看会怎样”这是活跃型学习者的口头禅。而“我们先好好想想吧”是沉思型学习者的通常反应。活跃型学习者比倾向于独立工作的沉思型学习者更喜欢集体工作。 每个人都是有时候是活跃型，有时候是沉思型的，只是有时候某种倾向的程度不同，可能很强烈或一般，亦或很轻微。
     *
     * 2.感悟型与直觉型
     * 感悟型学习者喜欢学习事实，而直觉型学习者倾向于发现某种可能性和事物间的关系。感悟型的不喜欢复杂情况和突发情况，而直觉型的喜欢革新不喜欢重复。感悟型的比直觉型的更痛恨测试一些在课堂里没有明确讲解过的内容。感悟型的对细节很有耐心，很擅长记忆事实和做一些现成的工作。直觉型的更擅长于掌握新概念，比感悟型的更能理解抽象的数学公式。 感悟型的比直觉型的更实际和仔细，而直觉型的又比感悟型的工作得更快更具有创新性。感悟型的不喜欢与现实生活没有明显联系的课程；直觉型的不喜欢那些包括许多需要记忆和进行常规计算的课程。每个人都是有时是感悟型的，有时是直觉型的，只是有时候其中某一种的倾向程度不同。要成为一个有效的学习者和问题解决者，你要学会适应两种方式。如果你过于强调直觉作用，你会错过一些重要细节或是在计算和现成工作中犯粗心的毛病。如果你过于强调感悟作用，你会过于依赖记忆和熟悉的方法，而不能充分地集中思想理解和创新。
     *
     * 3.视觉型与言语型
     * 视觉型学习者很擅长记住他们所看到的东西，如图片、图表、流程图、图像、影片和演示中的内容，言语型学习者更擅长从文字的和口头的解释中获取信息。当通过视觉和听觉同时呈现信息时，每个人都能获得更多的信息。在大学里很少呈现视觉信息，学生都是通过听讲和阅读写在黑板上及课本里的材料来学习。不幸的是，大部分学生都是视觉型学习者，也就是说学生通过这种方式获得的信息量不如通过呈现可视材料的方法获得的信息量大。
     *
     * 4.序列型与综合型
     * 序列型学习者习惯按线性步骤理解问题，每一步都合乎逻辑地紧跟前一步。综合型学习者习惯大步学习，吸收没有任何联系的随意的材料，然后突然获得它。序列型学习者倾向于按部就班地寻找答案；综合型学习者或许能更快地解决复杂问题或者一旦他们抓住了主要部分就用新奇的方式将它们组合起来，但他们却很难解释清楚他们是如何工作的。许多人读到这段描述会错误的认为他们是综合型的，以为每一个人都有恍然大悟的经历。序列型学习者可能没有完全了解材料，但他们能以此做些事情（如：做家庭作业或参加考试），因为他们掌握的是逻辑相连的。另一方面，那些缺乏顺序思考能力的极端综合型学习者即使对材料有了大概的了解，他们可能对一些细节还是很模糊，而序列型学习者能对主题的特殊方面知道许多但联系到同一主题的其他方面或不同的主题时，他们就表现得很困难。
     */
}
